Catalogs/ПакетыОпционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПакетыОпционов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Держатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДержателиОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОпционов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВестинга</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВестинга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДосрочногоЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВызревшиеОпционы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроданныеОпционы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусПакетаОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокОпционов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СтатусПакетаОпционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусПакетаОпционов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Активен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПакетыОпционов/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	ВызревшиеОпционы = МодульВестинга.РассчитатьВестинг(ЭтотОбъект.ДатаНачалаВестинга, ЭтотОбъект.СрокВестинга, ЭтотОбъект.КоличествоОпционов);
	ЭтотОбъект.ВызревшиеОпционы = ВызревшиеОпционы;
	ЭтотОбъект.ОстатокОпционов = ВызревшиеОпционы - ЭтотОбъект.ПроданныеОпционы;  
	
	Если (ТекущаяДата() >= ДобавитьМесяц(ЭтотОбъект.ДатаНачалаВестинга, ЭтотОбъект.СрокВестинга * 12)) И 
       (ЭтотОбъект.ПроданныеОпционы = ЭтотОбъект.КоличествоОпционов) Тогда
        ЭтотОбъект.Статус = Перечисления.СтатусПакетаОпционов.Закрыт;
	КонецЕсли;    
	Если ЭтоНовый() Тогда	   	ОбъектДержателя = ЭтотОбъект.Держатель.ПолучитьОбъект();
		АдресПолучателя = ОбъектДержателя.Почта;
		ФИОПолучателя = ОбъектДержателя.ФИО;
		ТемаПисьма = "Новый пакет опционов ✔️" ;

		ТекстПисьма = "Уважаемый(ая) " + ФИОПолучателя + ", " +  Символы.ПС + Символы.ПС +	        
	                  "Рады сообщить, что вам начислен новый пакет опционов.✨" +  Символы.ПС + Символы.ПС +
					  "Детали пакета: " +  Символы.ПС +	 
					"☺️Наименование пакета: " + ЭтотОбъект.Наименование + "." + Символы.ПС +
					  "⏰Дата начала вестинга: " + Формат(ЭтотОбъект.ДатаНачалаВестинга, "ДФ=dd.MM.yyyy") + "." +  Символы.ПС +	
					  "⭐Количество опционов в пакете: " + ЭтотОбъект.КоличествоОпционов + "." +  Символы.ПС + 
					  "⏳Срок вестинга: " + ЭтотОбъект.СрокВестинга + " год (лет)." +  Символы.ПС +  Символы.ПС + 
					"Вы можете ознакомиться с подробными условиями в личном кабинете.☑️" +  Символы.ПС +  Символы.ПС +  
					"Если у вас возникли вопросы, наша служба поддержки всегда готова помочь:" + Символы.ПС +
					            "✉️ ESOP-1C-men@yandex.ru" + Символы.ПС + Символы.ПС +
					"С уважением," + Символы.ПС +
					"Команда ООО «Профи.pу»❤️";
		
	МодульПочты.ОтправитьПисьмо(АдресПолучателя, ТемаПисьма, ТекстПисьма);
	КонецЕсли;



КонецПроцедуры 

Процедура ПриЗаписи(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры
